openfoam/OpenFOAM-dev/tutorials/fluid/helmholtzResonance/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    0.1 [g/s];
        value           $internalField;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      $internalField;
        value           $internalField;
    }

    symmetry
    {
        type            symmetry;
    }

    wall
    {
        type            fixedValue;
        value           $internalField;
    }

    plenum
    {
        type            pressureInletVelocity;
        value           $internalField;
    }
}

// ************************************************************************* //
